<!DOCTYPE html>

<html>
<head>
    <title>Qbita - Data</title>
    <meta name="description" content="Qbita.com.ar - Sitio web que trabaja con el concepto de arte que modifica la persepción urbana, desde la ubicación web. Trabaja con una galería de realidad aumentaba, basadas en pinturas de artístas destacados." />
    <meta name="keywords" content="realidad, aumentada, galeria, arte" />
    <meta name="author" content="Andón Pablo, Eberhardt Nicolás, Colletti Karen, Buioli Ignacio" />
    <meta http-equiv="content-type" content="text/html;charset=UTF-8" />
    <link rel="icon" type="image/x-icon" href="../img/favicon.ico" />
    <link href='../estilo.css' rel='stylesheet' type='text/css'>
    <script src="../jquery.min.js" language="javascript" type="text/javascript"></script>
    <script src="../jquery.validate.js" language="javascript" type="text/javascript"></script>
</head>

<body>
  <div id="header">
    <div style="background:#000;width:18px;height:18px;left:0;bottom:0;position:absolute;">
    </div>
    <h1>
      <a href="../index.html"><img src="../img/biner.gif" alt="Qbita" class="imgh1" />Qbita</a>
      <span style="font-size:12px;">beta</span>
    </h1>
    <ul>
      <li class="bordeando"><a href="../galeria/index.html">Galer&iacute;a</a></li>
      <li class="bordeando"><a href="../data/index.html">Data</a></li>
      <li class="bordeando"><a href="../proyecto/index.html">Proyecto</a></li>
      <li class="borde-sin-borde"><a href="../donde_estoy/index.html" class="donde">¿D&oacute;nde Estoy?</a></li>
    </ul>
    <div style="background:#000;width:18px;height:18px;right:0;bottom:0;position:absolute;"></div>
  </div>
    <div id="con">
        <div id="entradas">
            <h2>Concepto</h2><p>El concepto base en el cual se centra el proyecto es una teor&iacute;a cient&iacute;fica planteada por el f&iacute;sico Erwin Schr&ouml;dinger. Se trata de una paradoja, un ejercicio mental para explicar lo divergente que puede ser la f&iacute;sica cu&aacute;ntica. El experimento (conocido como el Gato de Schr&ouml;dinger), consiste en encerrar en una caja totalmente opaca un gato, un martillo y una botella de veneno. El martillo se conectar&iacute;a a un detector de electrones, y a este se le disparar&iacute;a un electr&oacute;n que previamente deber&aacute; optar por una de dos rutas. Si el electr&oacute;n toma la primer ruta, el detector lo alcanzar&aacute;, este activar&aacute; el martillo, el martillo romper&aacute; la botella y el veneno matar&aacute; al gato. Sin embargo, si toma la segunda ruta, el detector no se activar&aacute; y el gato vivir&aacute;. Por su capacidad cu&aacute;ntica de estar en dos sitios al mismo tiempo, el electr&oacute;n habr&aacute; tomado ambas rutas a la vez, por lo cual el gato se encontrar&aacute; vivo y muerto a la vez. Este concepto de superposici&oacute;n de la contraposici&oacute;n es el concepto clave para definir el proyecto en cuesti&oacute;n. La idea del todo/nada, de estar en todos lados y a la vez no estar en ning&uacute;n sitio.<br /><br />Experimento de la Doble Rendija: <a href="http://youtu.be/fUZZgDOrY30" target="_blank">youtu.be/fUZZgDOrY30</a><br />Gato de Schr&ouml;dinger: <a href="http://youtu.be/JC9A_E5kg7Y" target="_blank">youtu.be/JC9A_E5kg7Y</a></p>
            <h2>Tecnolog&iacute;a y Soporte</h2><img src="img/movil.gif" alt="Movil" class="derecha" /><p>Se planea la utilizaci&oacute;n de dispositivos m&oacute;viles y tablet para la visualizaci&oacute;n del sitio en exteriores. No obstante, el uso de laptops (notebooks o netbooks) es tambi&eacute;n una opci&oacute;n v&aacute;lida. Esto deriva de la idea de pr&oacute;tesis y por una comodidad del usuario al momento de desplazarse.<br />Por otro lado, se opt&oacute; por desarrollar las obras en realidad aumentada. Las razones fueron muchas, pero principalmente la gran relaci&oacute;n inform&aacute;tica de las im&aacute;genes en binario con las obras en s&iacute;, y la fuerza de la ubicaci&oacute;n de cada obra con relaci&oacute;n al sitio y a una comunidad de usuarios.<br />Para la vers&oacute;n de 2011, se utiliz&oacute; un SWF y ActionScript. En su momento, la librer&iacute;a utilizada para realidad aumentada fue <a href="http://www.libspark.org/wiki/saqoosha/FLARToolKit/en">FLARToolKit</a>, con Papervision y AsCollada. Actualmente, se utiliza la librería JSARToolKit, ThreeJS y ColladaLoader. Para generar el 3D se exporta un formato DAE desde el programa <a href="http://www.blender.org/">Blender</a>.</p>
            <h2>Investigaci&oacute;n de Artistas</h2><p>Una idea general es no centrarse en artistas pl&aacute;sticos solamente, sino tambi&eacute;n en escritores y m&uacute;sicos. por lo tanto, la investigaci&oacute;n va referida a la mayor cobertura posible de artistas de una determinada regi&oacute;n.<br /><br />Lista de "los coleccionistas": <a href="http://www.loscoleccionistas.com/trastienda.html" target="_blank">loscoleccionistas.com/trastienda</a><br />Mapa de artistas de la boca: <a href="http://www.buenosaires.gov.ar/areas/cultura/arteargentino/02dossiers/la_boca/0_3_artistas.php?menu_id=15602" target="_blank">buenosaires.gov.ar/laboca</a><br />Webmuseum: <a href="http://www.ibiblio.org/wm/paint/auth/" target="_blank">ibiblio.org/wm/paint/auth</a><br />Acropolisinc: <a href="http://cgfa.acropolisinc.com/a.htm" target="_blank">cgfa.acropolisinc.com</a><br />Pintores Famosos: <a href="http://www.pintoresfamosos.cl/" target="_blank">pintoresfamosos.cl</a><br />Mariano Ferrante: <a href="http://www.marianoferrante.com.ar/" target="_blank">marianoferrante.com.ar</a><br />Emilio Pettoruti: <a href="http://www.pettoruti.com/" target="_blank">pettoruti.com</a><br />Piet Mondrian: <a href="http://www.pietmondrian.org/" target="_blank">pietmondrian.org</a></p>
            <h2>Geolocalizaci&oacute;n</h2><img src="img/mapa.gif" alt="Mapa" class="derecha" /><p>&iquest;C&oacute;mo sabe el usuario d&oacute;nde est&aacute;n las obras? &iquest;C&oacute;mo sabe que est&aacute;n cerca o lejos de su vivienda? En este sentido, podr&iacute;a tener una obra a pocos metros de su vivienda y no saberlo. Por lo tanto, se incluy&oacute; como una secci&oacute;n importante a la geolocalizaci&oacute;n. relacion&aacute;ndose directamente con los dispositivos m&oacute;viles, el usuario puede consultar en cualquier momento su ubicaci&oacute;n y relacionarla con la ubicaci&oacute;n de alguna obra que desee ver. De esta manera, se mantiene en el sitio hasta el momento de ver la obra a trav&eacute;s del mismo.</p>
            <h2>Met&aacute;fora</h2><img src="img/galeria.gif" alt="Metafora" class="derecha" /><p>El sitio trabaja con una met&aacute;fora de galer&iacutea de arte, donde los cuadros que se exponen son simplemente los c&oacute;digos binarios. Adem&aacute;s, se recurre a no tener un lugar fijo para mostrar las obras, sino a que las obras vayan a la calle, al alcance de todos. Concepto resignificado de la Bauhaus. Alejandro Jodorowsky dice que los museos son los cementerios del arte. Parece ser que cuando el arte no est&aacute; integrado en la sociedad, en el tiempo presente y en relaci&oacute;n con la gente se convierte en algo muerto. No es org&aacute;nico, no est&aacute; vivo, es una mascarada.</p>
            <h2>Mapa de Informaci&oacute;n</h2><center><p><img src="img/mapadeinfo.gif" alt="Mapa de Informacion" /></p></center>
            <h2>De 3D a Capas</h2><p>Una gran problem&aacute;tica fue la correcta implementaci&oacute;n del 3D con texturas manuales. El problema consist&iacute;a en la inmensa cantidad de pol&iacute;gonos que se necesitaban para una obra en 3D que se vea bien, sumado a las texturas produc&iacute;an un entramado de caos en la reproducci&oacute;n del sistema en cuesti&oacute;n. El pasaje se produjo lentamente, tratando de restar la cantidad de pol&iacute;gonos internos, logrando bases mas plenas. Sin embargo, los resultados no fueron los esperados. Si bien el tama&ntilde;o del archivo se reduc&iacute;a y la reproducci&oacute;n era mas limpia, no era suficiente para que esto tenga un soporte en la web. Finalmente, bas&aacute;ndonos en la t&eacute;cnica de Recorrido Visual 3D, generamos planos de im&aacute;genes con profundidad, lo cual permite fragmentar mejor la obra (a nivel de imagen) y poder manipular la profundidad de las capas para generar el 3D. Esto produce una obra limpia y liviana.<img src="img/3dcapa.gif" alt="De 3D a Capas" /></p>
            <h2>Pecha Kucha</h2><center><p><iframe class="scribd_iframe_embed" src="https://www.scribd.com/embeds/71369346/content?start_page=1&view_mode=slideshow&access_key=key-8rpcoyc9tyvmrtz9v85" data-auto-height="false" data-aspect-ratio="1.2938689217759" scrolling="no" id="doc_53454" width="450" height="419" frameborder="0"></iframe></p></center>
            <h2>Pruebas de RA 1</h2><center><p><img src="img/ra1.jpg" alt="Realidad Aumentada 1" /> <img src="img/ra2.jpg" alt="Realidad Aumentada 2" /><br /><img src="img/ra3.jpg" alt="Realidad Aumentada 3" /> <img src="img/ra4.jpg" alt="Realidad Aumentada 4" /></p></center>
            <h2>Pruebas de RA 2</h2><center><p><img src="img/ra5.jpg" alt="Realidad Aumentada 5" /> <img src="img/ra6.jpg" alt="Realidad Aumentada 6" /><br /><img src="img/ra7.jpg" alt="Realidad Aumentada 7" /> <img src="img/ra8.jpg" alt="Realidad Aumentada 8" /></p></center>
            <h2>Contenedor para Muestras</h2><center><p><img src="img/c01.jpg" alt="Contenedor Armado 01" /><br /><img src="img/c02.jpg" alt="Contenedor Armado 02" /></p></center>
            <h2>Qbita UX</h2><p>En plan de mantener un contacto entre los autores y los espectadores o interesados en participar del proyecto, se crea un Blog donde se muestren las versiones previas de Qbita. En el mismo se podrán subir archivos, ideas, preguntas o reportar un bug o una deficiencia del programa.<br /><br />Qbita UX Blog: <a href="http://qbita.blogspot.com/" target="_blank">qbita.blogspot.com</a></p>
        </div>
        <div id="e_lista">
            <h2>Entradas</h2>
            <ul>
            <li><a href="#" id="concepto">Concepto</a></li>
            <li><a href="#" id="tecno">Tecnolog&iacute;a y Soporte</a></li>
            <li><a href="#" id="investigacion">Investigaci&oacute;n de Artistas</a></li>
            <li><a href="#" id="geoloca">Geolocalizaci&oacute;n</a></li>
            <li><a href="#" id="metaf">Met&aacute;fora</a></li>
            <li><a href="#" id="mapainfo">Mapa de Informaci&oacute;n</a></li>
            <li><a href="#" id="3dcapa">De 3D a Capas</a></li>
            <li><a href="#" id="pecha">Pecha Kucha</a></li>
            <li><a href="#" id="pRa">Pruebas de RA 1</a></li>
            <li><a href="#" id="pRa2">Pruebas de RA 2</a></li>
            <li><a href="#" id="cRa">Contenedor para Muestras</a></li>
            <li><a href="#" id="cUx">Qbita UX</a></li>
            </ul>
        </div>
    </div>
    <script src="../units/programa.js" language="javascript" type="text/javascript"></script>
  </body>
</html>
